# MAVEN MOVIES DATABASE - ANALYTICS USING SQL AND PYTHON3

## This database belongs to maven analytics and I'll be using it to answer some key question a manager or supervisor of the maven movies store might ask

#### 1) The Database is in MySql and I'll be using MySql connector to query the Database , I'll also try to create visualizations regarding the queried data , which help in informed decision making

In [14]:
import mysql.connector
from tabulate import tabulate

## Connecting to Database and Password has been removed for privacy purposes

#### Creating a cursor to parse the database

In [15]:
mycursor = mydb.cursor()

#### A simple query to get the store_id , last_name and first_name of 5 customers

In [16]:
mycursor.execute("USE mavenmovies")
mycursor.execute("SELECT store_id,last_name,first_name FROM customer LIMIT 5 ")
myresult = mycursor.fetchall()
print(tabulate(myresult, headers = ['store_id','last_name','first_name'] ,tablefmt='mysql'))

  store_id  last_name    first_name
----------  -----------  ------------
         1  SMITH        MARY
         1  JOHNSON      PATRICIA
         1  WILLIAMS     LINDA
         2  JONES        BARBARA
         1  BROWN        ELIZABETH

In [30]:
mycursor.execute("SELECT store_id,last_name,first_name FROM customer LIMIT 5 ")
myresult = mycursor.fetchall()

for row in myresult:
    fname = row[2]
    lname = row[1]
    store_id = row[0]
    # Now print fetched result
    print("store_id  last_name    first_name")
    print(fname,"   ", lname,"   ", store_id )
    print("\n")

store_id  last_name    first_name
MARY     SMITH     1


store_id  last_name    first_name
PATRICIA     JOHNSON     1


store_id  last_name    first_name
LINDA     WILLIAMS     1


store_id  last_name    first_name
BARBARA     JONES     2


store_id  last_name    first_name
ELIZABETH     BROWN     1

### 1.	We will need a list of all staff members, including their first and last names, email addresses, and the store identification number where they work.

In [32]:
query = """

SELECT first_name, last_name , email , store_id
FROM staff
"""
mycursor.execute(query)
myresult = mycursor.fetchall()
print(tabulate(myresult, headers = ['first_name', 'last_name' , 'email' , 'store_id'] ,tablefmt='mysql'))

first_name    last_name    email                           store_id
------------  -----------  ----------------------------  ----------
Mike          Hillyer      Mike.Hillyer@sakilastaff.com           1
Jon           Stephens     Jon.Stephens@sakilastaff.com           2

## We can also convert the queried output to a pandas dataFrame and then can carry out visualiztion / cleaning etc

In [33]:
import pandas as pd

In [36]:
query = """

SELECT first_name, last_name , email , store_id
FROM staff
"""
mycursor.execute(query)

myresult = mycursor.fetchall()

In [37]:
df_query1 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query1.columns = column_names

In [38]:
df_query1

  first_name last_name                         email  store_id
0       Mike   Hillyer  Mike.Hillyer@sakilastaff.com         1
1        Jon  Stephens  Jon.Stephens@sakilastaff.com         2

### 2) We will need separate counts of inventory items held at each of your two stores

In [39]:
query = """
SELECT COUNT(inventory_id), store_id
FROM inventory 
GROUP BY store_id
"""
mycursor.execute(query)

myresult = mycursor.fetchall()
df_query2 = pd.DataFrame(myresult)

column_names = [i[0] for i in mycursor.description]

df_query2.columns = column_names

In [40]:
df_query2

   COUNT(inventory_id)  store_id
0                 2270         1
1                 2311         2